beber007/zottaos/ZottaOS/CORTEX-M3/STM32/ZottaOS_TimerEvent.c
/* Copyright (c) 2006-2012 MIS Institute of the HEIG-VD affiliated to the University of
** Applied Sciences of Western Switzerland. All rights reserved.
** Permission to use, copy, modify, and distribute this software and its documentation
** for any purpose, without fee, and without written agreement is hereby granted, pro-
** vided that the above copyright notice, the following three sentences and the authors
** appear in all copies of this software and in the software where it is used.
** IN NO EVENT SHALL THE MIS INSTITUTE NOR THE HEIG-VD NOR THE UNIVERSITY OF APPLIED
** SCIENCES OF WESTERN SWITZERLAND BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL,
** INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS
** DOCUMENTATION, EVEN IF THE MIS INSTITUTE OR THE HEIG-VD OR THE UNIVERSITY OF APPLIED
** SCIENCES OF WESTERN SWITZERLAND HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
** THE MIS INSTITUTE, THE HEIG-VD AND THE UNIVERSITY OF APPLIED SCIENCES OF WESTERN SWIT-
** ZERLAND SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
** IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE SOFT-
** WARE PROVIDED HEREUNDER IS ON AN "AS IS" BASIS, AND THE MIS INSTITUTE NOR THE HEIG-VD
** AND NOR THE UNIVERSITY OF APPLIED SCIENCES OF WESTERN SWITZERLAND HAVE NO OBLIGATION
** TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.
*/
/* File TimerEvent.c: Implements an event queue that is associated with a timer device.
** Events that are inserted into the queue are specified along with a delay, and as soon
** as this delay has expired, the event is scheduled.
** Platform version: All STM32 microcontrollers.
** Version date: March 2012
** Authors: MIS-TIC */

#include "ZottaOS_CortexM3.h"
#include "ZottaOS.h"
#include "ZottaOS_TimerEvent.h"

/* Because the timer continues ticking, when we wish to set a new value for the timer
** comparator, the difference in time between the new value and the previous must be such
** that when the assignment is done, the timer has not passed the comparator value. This
** is guaranteed by TIMER_OFFSET. */
#define TIMER_OFFSET 2
/* Because events are sorted by the time at which they occur, and that this time is mon-
** otonically increasing, the relative time reference wraparounds. We therefore need to
** periodically shift the occurrence times. This is done very SHIFT_TIME_LIMIT tics. */
#define SHIFT_TIME_LIMIT 0x40000000 // = 2^30

#ifdef OS_IO_TIM1
   #if defined(STM32F1XXXX)
      #define BASE_TIM1 0x40012C00
   #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
      #define BASE_TIM1 0x40010000
   #else
      #error Base address must be specified
   #endif
#endif
#ifdef OS_IO_TIM2
   #define BASE_TIM2 0x40000000
#endif
#ifdef OS_IO_TIM3
   #define BASE_TIM3 0x40000400
#endif
#ifdef OS_IO_TIM4
   #define BASE_TIM4 0x40000800
#endif
#ifdef OS_IO_TIM5
   #define BASE_TIM5 0x40000C00
#endif
#ifdef OS_IO_TIM8
   #if defined(STM32F1XXXX)
      #define BASE_TIM8 0x40013400
   #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
      #define BASE_TIM8 0x40010400
   #else
      #error Base address must be specified
   #endif
#endif
#ifdef OS_IO_TIM9
   #if defined(STM32L1XXXX)
      #define BASE_TIM9 0x40010800
   #elif defined(STM32F1XXXX)
      #define BASE_TIM9 0x40014C00
   #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
      #define BASE_TIM9 0x40014000
   #else
      #error Base address must be specified
   #endif
#endif
#ifdef OS_IO_TIM10
   #if defined(STM32L1XXXX)
      #define BASE_TIM10 0x40010C00
   #elif defined(STM32F1XXXX)
      #define BASE_TIM10 0x40015000
   #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
      #define BASE_TIM10 0x40014400
   #else
      #error Base address must be specified
   #endif
#endif
#ifdef OS_IO_TIM11
   #if defined(STM32L1XXXX)
      #define BASE_TIM11 0x40011000
   #elif defined(STM32F1XXXX)
      #define BASE_TIM11 0x40015400
   #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
      #define BASE_TIM11 0x40014800
   #else
      #error Base address must be specified
   #endif
#endif
#ifdef OS_IO_TIM12
   #define BASE_TIM12 0x40001800
#endif
#ifdef OS_IO_TIM13
   #define BASE_TIM13 0x40001C00
#endif
#ifdef OS_IO_TIM14
   #define BASE_TIM14 0x40002000
#endif
#ifdef OS_IO_TIM15
   #define BASE_TIM15 0x40014000
#endif
#ifdef OS_IO_TIM16
   #define BASE_TIM16 0x40014400
#endif
#ifdef OS_IO_TIM17
   #define BASE_TIM17 0x40014800
#endif

#define OFFSET_CONTROL1         0x00
#define OFFSET_INT_ENABLE       0x0C
#define OFFSET_STATUS           0x10
#define OFFSET_EVENT_GENERATION 0x14
#define OFFSET_COUNTER          0x24
#define OFFSET_PRESCALER        0x28
#define OFFSET_AUTORELOAD       0x2C
#define OFFSET_COMPARATOR       0x34


typedef struct TIMER_EVENT_NODE { // Blocks that in the event queue
  struct TIMER_EVENT_NODE *Next;
  void *Event;
  INT32 Time;
} TIMER_EVENT_NODE;

typedef struct { // Queue of events with their associated time of occurrence
  TIMER_EVENT_NODE *Next;
} TIMER_EVENT_NODE_HEAD;

typedef struct TIMER_ISR_DATA {
  void (*TimerIntHandler)(struct TIMER_ISR_DATA *);
  UINT32 *ClkEnable;
  UINT32 ClkEnableBit;
  UINT32 Base;
  INT32 Time;                        // Current time
  void *PendingQueueOperation;       // Interrupted operations that are not complete
  TIMER_EVENT_NODE_HEAD *EventQueue; // List of events sorted by their time of occurrence
  TIMER_EVENT_NODE *FreeNodes;       // Pool of free nodes used to link events
} TIMER_ISR_DATA;


typedef enum {InsertEventOp,DeleteEventOp} EVENTOP;

typedef struct {
  EVENTOP EventOp;
  volatile BOOL Done;
  TIMER_EVENT_NODE *Left;
  TIMER_EVENT_NODE *Node;
  volatile BOOL GeneratedInterrupt;
} INSERTQUEUE_OP;

typedef struct {
  EVENTOP EventOp;
  volatile BOOL Done;
  TIMER_EVENT_NODE *Left;
  TIMER_EVENT_NODE *Node;
  volatile BOOL GenerateInterrupt;
  void *Event;
} DELETEQUEUE_OP;


static void InsertQueueHelper(INSERTQUEUE_OP *des, TIMER_ISR_DATA *device, BOOL genInt);
static void DeleteQueueHelper(DELETEQUEUE_OP *des);
static TIMER_EVENT_NODE *GetFreeNode(TIMER_ISR_DATA *device);
static void ReleaseNode(TIMER_ISR_DATA *device, TIMER_EVENT_NODE *node);
static void TimerIntHandler(TIMER_ISR_DATA *device);

/* OSInitTimerEvent: Creates an ISR descriptor block holding the specifics of a timer
** device that is used as an event handler and which can schedule a list of event at
** their occurrence time. */
void OSInitTimerEvent(UINT8 nbNode, UINT8 timerIndex, UINT16 prescaler)
{
  TIMER_ISR_DATA *device;
  UINT8 i, tmppriority, *intPriorityLevel;
  UINT32 *intSetEnable;

  device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
  device->TimerIntHandler = TimerIntHandler;

