beber007/zottaos/ZottaOS/CORTEX-M3/STM32/ZottaOS_TimerEvent.c
  *(UINT16 *)(device->Base + OFFSET_PRESCALER) = prescaler; // Set the prescaler value
  *(UINT16 *)(device->Base + OFFSET_EVENT_GENERATION) = 1; // Generate an update event to reload the prescaler
  *(UINT16 *)(device->Base + OFFSET_STATUS) = (UINT16)~3; // Clear update flag
  *(UINT16 *)(device->Base + OFFSET_INT_ENABLE) |= 3; // Enable update interrupt

  /* Compute the IRQ priority */
  tmppriority = TIMER_PRIORITY << (PRIGROUP - 3);
  // le nombre 3 correspond au nombre maximum de bits pour la priorité moins le nombre de bit implémenté soit (7 -4 pour le stm32)
  tmppriority |=  TIMER_SUB_PRIORITY & (0x0F >> (7 - PRIGROUP));
  // (7 - PRIGROUP) correspond aux nombres de bits pour la priorité.
  // (4 correpond à 8 moins le nombre de bit implémenter dans le STM32(4))

  switch (timerIndex) { /* Specific timer device registers */
     #ifdef OS_IO_TIM1
     case OS_IO_TIM1:
        #if defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x40021018; // RCC_APB2ENR
           device->ClkEnableBit = 0x800;
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023844; // RCC_APB2ENR
           //ClkEnable = (UINT32 *)0x40023864; // RCC_APB2LPENR
           device->ClkEnableBit = 0x1;
        #endif
        device->Base = BASE_TIM1;
        OSSetISRDescriptor(OS_IO_TIM1_UP,device);
        OSSetISRDescriptor(OS_IO_TIM1_CC,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(OS_IO_TIM1_UP / 32);
        *intSetEnable |= 0x01 << (OS_IO_TIM1_UP % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + OS_IO_TIM1_UP);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority
        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(OS_IO_TIM1_CC / 32);
        *intSetEnable |= 0x01 << (OS_IO_TIM1_CC % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + OS_IO_TIM1_CC);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM2
     case OS_IO_TIM2:
        #if defined(STM32L1XXXX)
           device->ClkEnable = (UINT32 *)0x40023824; // RCC_APB1ENR
           //device->ClkEnable = (UINT32 *)0x40023830; // RCC_APB1LPENR
        #elif defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x4002101C; // RCC_APB1ENR
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023840; // RCC_APB1ENR
           //device->ClkEnable = (UINT32 *)0x40023860; // RCC_APB1LPENR
        #endif
        device->ClkEnableBit = 0x1;
        device->Base = BASE_TIM2;
        OSSetISRDescriptor(timerIndex,device);

        #if defined(STM32F2XXXX) || defined(STM32F4XXXX)
           *(UINT32 *)(device->Base + OFFSET_AUTORELOAD) = 0x3FFFFFFF; // Set the autoreload value (2^30 - 1)
        #else
           *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value
        #endif

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM3
     case OS_IO_TIM3:
        #if defined(STM32L1XXXX)
           device->ClkEnable = (UINT32 *)0x40023824; // RCC_APB1ENR
           //device->ClkEnable = (UINT32 *)0x40023830; // RCC_APB1LPENR
        #elif defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x4002101C; // RCC_APB1ENR
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023840; // RCC_APB1ENR
           //device->ClkEnable = (UINT32 *)0x40023860; // RCC_APB1LPENR
        #endif
        device->ClkEnableBit = 0x2;
        device->Base = BASE_TIM3;
        OSSetISRDescriptor(timerIndex,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM4
     case OS_IO_TIM4:
        #if defined(STM32L1XXXX)
           device->ClkEnable = (UINT32 *)0x40023824; // RCC_APB1ENR
           //device->ClkEnable = (UINT32 *)0x40023830; // RCC_APB1LPENR
        #elif defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x4002101C; // RCC_APB1ENR
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023840; // RCC_APB1ENR
           //device->ClkEnable = (UINT32 *)0x40023860; // RCC_APB1LPENR
        #endif
        device->ClkEnableBit = 0x4;
        device->Base = BASE_TIM4;
        OSSetISRDescriptor(timerIndex,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM5
     case OS_IO_TIM5:
        #if defined(STM32L1XXXX)
           device->ClkEnable = (UINT32 *)0x40023824; // RCC_APB1ENR
           //device->ClkEnable = (UINT32 *)0x40023830; // RCC_APB1LPENR
        #elif defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x4002101C; // RCC_APB1ENR
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023840; // RCC_APB1ENR
           //device->ClkEnable = (UINT32 *)0x40023860; // RCC_APB1LPENR
        #endif
        device->ClkEnableBit = 0x8;
        device->Base = BASE_TIM5;
        OSSetISRDescriptor(timerIndex,device);

