beber007/zottaos/ZottaOS/CORTEX-M3/STM32/ZottaOS_TimerEvent.c
        #if defined(STM32L1XXXX) || defined(STM32F2XXXX) || defined(STM32F4XXXX)
           *(UINT32 *)(device->Base + OFFSET_AUTORELOAD) = 0x3FFFFFFF; // Set the autoreload value (2^30 - 1)
        #else
           *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value
        #endif

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM8
     case OS_IO_TIM8:
        #if defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x40021018; // RCC_APB2ENR
           device->ClkEnableBit = 0x2000;
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023844; // RCC_APB2ENR
           //device->ClkEnable = (UINT32 *)0x40023864; // RCC_APB2LPENR
           device->ClkEnableBit = 0x2;
        #endif
        device->Base = BASE_TIM8;
        OSSetISRDescriptor(OS_IO_TIM8_UP,device);
        OSSetISRDescriptor(OS_IO_TIM8_CC,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(OS_IO_TIM8_UP / 32);
        *intSetEnable |= 0x01 << (OS_IO_TIM8_UP % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + OS_IO_TIM8_UP);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority
        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(OS_IO_TIM8_CC / 32);
        *intSetEnable |= 0x01 << (OS_IO_TIM8_CC % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + OS_IO_TIM8_CC);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM9
     case OS_IO_TIM9:
        #if defined(STM32L1XXXX)
           device->ClkEnable = (UINT32 *)0x40023820; // RCC_APB2ENR
           //device->ClkEnable = (UINT32 *)0x4002382C; // RCC_APB2LPENR
           device->ClkEnableBit = 0x04
        #elif defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x40021018; // RCC_APB2ENR
           device->ClkEnableBit = 0x080000;
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023844; // RCC_APB2ENR
           //device->ClkEnable = (UINT32 *)0x40023864; // RCC_APB2LPENR
           device->ClkEnableBit = 0x10000;
        #endif
        device->Base = BASE_TIM9;
        OSSetISRDescriptor(timerIndex,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM10
     case OS_IO_TIM10:
        #if defined(STM32L1XXXX)
           device->ClkEnable = (UINT32 *)0x40023820; // RCC_APB2ENR
           //device->ClkEnable = (UINT32 *)0x4002382C; // RCC_APB2LPENR
           device->ClkEnableBit = 0x08
        #elif defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x40021018; // RCC_APB2ENR
           device->ClkEnableBit = 0x100000;
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023844; // RCC_APB2ENR
           //device->ClkEnable = (UINT32 *)0x40023864; // RCC_APB2LPENR
           device->ClkEnableBit = 0x20000;
        #endif
        device->Base = BASE_TIM10;
        OSSetISRDescriptor(timerIndex,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM11
     case OS_IO_TIM11:
        #if defined(STM32L1XXXX)
           device->ClkEnable = (UINT32 *)0x40023820; // RCC_APB2ENR
           //device->ClkEnable = (UINT32 *)0x4002382C; // RCC_APB2LPENR
           device->ClkEnableBit = 0x10
        #elif defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x40021018; // RCC_APB2ENR
           device->ClkEnableBit = 0x200000;
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023844; // RCC_APB2ENR
           //device->ClkEnable = (UINT32 *)0x40023864; // RCC_APB2LPENR
           device->ClkEnableBit = 0x40000;
        #endif
        device->Base = BASE_TIM11;
        OSSetISRDescriptor(timerIndex,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM12
     case OS_IO_TIM12:
        #if defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x4002101C; // RCC_APB1ENR
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023840; // RCC_APB1ENR
           //device->ClkEnable = (UINT32 *)0x40023860; // RCC_APB1LPENR
        #endif
        device->ClkEnableBit = 0x40;
        device->Base = BASE_TIM12;
        OSSetISRDescriptor(timerIndex,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM13
     case OS_IO_TIM13:
        #if defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x4002101C; // RCC_APB1ENR
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023840; // RCC_APB1ENR
           //device->ClkEnable = (UINT32 *)0x40023860; // RCC_APB1LPENR
        #endif
        device->ClkEnableBit = 0x80;
        device->Base = BASE_TIM13;
        OSSetISRDescriptor(timerIndex,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM14
     case OS_IO_TIM14:
        #if defined(STM32F1XXXX)
           device->ClkEnable = (UINT32 *)0x4002101C; // RCC_APB1ENR
        #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
           device->ClkEnable = (UINT32 *)0x40023840; // RCC_APB1ENR
           //device->ClkEnable = (UINT32 *)0x40023860; // RCC_APB1LPENR
        #endif
        device->ClkEnableBit = 0x100;
        device->Base = BASE_TIM14;
        OSSetISRDescriptor(timerIndex,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM15
     case OS_IO_TIM15:
        device->ClkEnable = (UINT32 *)0x40021018; // RCC_APB2ENR
        device->ClkEnableBit = 0x10000;
        device->Base = BASE_TIM15;
        OSSetISRDescriptor(timerIndex,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM16
     case OS_IO_TIM16:
        device->ClkEnable = (UINT32 *)0x40021018; // RCC_APB2ENR
        device->ClkEnableBit = 0x20000;
        device->Base = BASE_TIM16;
        OSSetISRDescriptor(timerIndex,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     #ifdef OS_IO_TIM17
     case OS_IO_TIM17:
        device->ClkEnable = (UINT32 *)0x40021018; // RCC_APB2ENR
        device->ClkEnableBit = 0x40000;
        device->Base = BASE_TIM17;
        OSSetISRDescriptor(timerIndex,device);

        *(UINT16 *)(device->Base + OFFSET_AUTORELOAD) = 0xFFFF; // Set the autoreload value

        intSetEnable = (UINT32 *)0xE000E100 + (UINT32)(timerIndex / 32);
        *intSetEnable |= 0x01 << (timerIndex % 32); // Enable the IRQ channels
        intPriorityLevel = (UINT8 *)(0xE000E400 + timerIndex);
        *intPriorityLevel = tmppriority << 0x04; // Set the IRQ priority

        break;
     #endif
     default:
     break;
  }
  device->Time = 0;
  device->PendingQueueOperation = NULL;
  /* Initialize event queue */
  device->EventQueue = (TIMER_EVENT_NODE_HEAD *)OSMalloc(sizeof(TIMER_EVENT_NODE_HEAD));
  device->EventQueue->Next = NULL;
  /* Create a pool of free event nodes */
  device->FreeNodes = (TIMER_EVENT_NODE *)OSMalloc(nbNode * sizeof(TIMER_EVENT_NODE));
  for (i = 0; i < nbNode - 1; i += 1)
     device->FreeNodes[i].Next = &device->FreeNodes[i+1];
  device->FreeNodes[i].Next = NULL;


  *device->ClkEnable |= device->ClkEnableBit;

} /* end of OSInitTimerEvent */


/* OSScheduleTimerEvent: Entry point to insert an event into the event list associated
** with a timer. */
BOOL OSScheduleTimerEvent(void *event, UINT32 delay, UINT8 interruptIndex)
{
  TIMER_EVENT_NODE *timerEventNode;
  TIMER_ISR_DATA *device;
  INSERTQUEUE_OP des, *pendingOp;
  device = (TIMER_ISR_DATA *)OSGetISRDescriptor(interruptIndex);
  if ((timerEventNode = GetFreeNode(device)) == NULL)
     return FALSE;
  /* Because the timer ISR can shift the current time, the time at which this event oc-
  ** curs is done in 2 steps. */
  #if defined(STM32L1XXXX)
     if (device->Base == BASE_TIM5) {
  #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
     if (device->Base == BASE_TIM2 || device->Base == BASE_TIM5) {
  #endif
  #if defined(STM32L1XXXX) ||  defined(STM32F2XXXX) || defined(STM32F4XXXX)
        timerEventNode->Time = delay | 0x80000000;
     }
     else {
  #endif
        timerEventNode->Time = (*(UINT16 *)(device->Base + OFFSET_COUNTER) + delay) | 0x80000000;
  #if defined(STM32L1XXXX) ||  defined(STM32F2XXXX) || defined(STM32F4XXXX)
     }
  #endif
  timerEventNode->Event = event;
  des.EventOp = InsertEventOp;  // Prepare the insertion so that other task may complete
  des.Done = FALSE;             // it.
  des.Left = (TIMER_EVENT_NODE *)device->EventQueue;
  des.Node = timerEventNode;
  des.GeneratedInterrupt = FALSE;
  pendingOp = (INSERTQUEUE_OP *)device->PendingQueueOperation;
  if (pendingOp != NULL) {      // Is there an incomplete operation under way?
     if (pendingOp->EventOp == InsertEventOp)
        InsertQueueHelper(pendingOp,device,TRUE);
     else
        DeleteQueueHelper((DELETEQUEUE_OP *)pendingOp);
  }
  /* Mark the node to allow a single insertion of the node */
  timerEventNode->Next = (TIMER_EVENT_NODE *)&des;
  device->PendingQueueOperation = &des;    // Post the insertion for other tasks
  InsertQueueHelper(&des,device,TRUE);     // Do the insertion
  device->PendingQueueOperation = NULL;
  return TRUE;
} /* end of OSScheduleTimerEvent */


/* InsertQueueHelper: Performs the insertion described by a descriptor into a sorted
** queue. Whenever an enqueuer is interrupted in the midst of the insertion by another
** task, the latter task inserts the node of the interrupted enqueuer before completing
** its own operation.
** Parameters:
**   (1) (INSERTQUEUE_OP *) insertion operation to perform;
**   (2) (TIMER_ISR_DATA *) descriptor to the timer in order to retrieve the current time
**          and to generate an interrupt if needed;
**   (3) (BOOL) TRUE when not called from the timer ISR. */
void InsertQueueHelper(INSERTQUEUE_OP *des, TIMER_ISR_DATA *device, BOOL genInterrupt)
{
  INT32 scheduledTime;
  TIMER_EVENT_NODE *right, *left = des->Left;
  /* Finish completing the time at which the event takes place. This is done here so that
  ** the timer ISR can set this time. Because the timer ISR shifts its current time to
  ** avoid overflow, the event occurrence time may not be finalized without the ISR's
  ** awareness. */
  while ((scheduledTime = OSINT32_LL(&des->Node->Time)) < 0) {
     #if defined(STM32L1XXXX)
        if (device->Base == BASE_TIM5) {
     #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
        if (device->Base == BASE_TIM2 || device->Base == BASE_TIM5) {
     #endif
     #if defined(STM32L1XXXX) ||  defined(STM32F2XXXX) || defined(STM32F4XXXX)
           if (OSINT32_SC(&des->Node->Time,(scheduledTime ^ 0x80000000) + *(UINT32 *)(device->Base + OFFSET_COUNTER) ))
              break;
        }
        else {
     #endif
           if (OSINT32_SC(&des->Node->Time,(scheduledTime ^ 0x80000000) + device->Time))
              break;
     #if defined(STM32L1XXXX) ||  defined(STM32F2XXXX) || defined(STM32F4XXXX)
        }
     #endif
  }
  while (TRUE) {         // Loop until done
     right = left->Next; // Get adjacent node
     if (des->Done)      // Has a higher priority task finished the work?
        break;
     else if (right == des->Node) { // Is the node already in the queue?
        des->Done = TRUE;           // Mark that node has been inserted
        break;
     }
     else if (right == NULL || des->Node->Time < right->Time) {
        UINTPTR *successorNode = (UINTPTR *)&des->Node->Next;
        while (OSUINTPTR_LL(successorNode) == (UINTPTR)des)
           if (OSUINTPTR_SC(successorNode,(UINTPTR)right))
              break;
        while (OSUINTPTR_LL((UINTPTR *)&left->Next) == (UINTPTR)right) {
           /* At this point an ABA problem can arise: Say that a task inserts node N
           ** between nodes A and B, and gets preempted. Another task completes the in-
           ** sertion, and then removes N. In this case, node N must not be reinserted.
           ** To correct this flaw, we simply need to check if another task completed the
           ** current insertion. */
           if (des->Done || OSUINTPTR_SC((UINTPTR *)&left->Next,(UINTPTR)des->Node))
              break;
        }
        des->Done = TRUE; // Mark that node has been inserted
        break;
     }
     else
        left = des->Left = right;
  }
  /* Generate a timer comparator interrupt if the inserted event is the first one. */
  if (genInterrupt)
     while (device->EventQueue->Next == des->Node) {
         OSUINT16_LL((UINT16 *)(device->Base + OFFSET_EVENT_GENERATION));
         if (des->GeneratedInterrupt || OSUINT16_SC((UINT16 *)(device->Base + OFFSET_EVENT_GENERATION),2))
            break;
     }
  des->GeneratedInterrupt = TRUE;
} /* end of InsertQueueHelper */


/* OSUnScheduleTimerEvent: Entry point to remove the first occurrence of a specified
** event from the list associated with a timer. */
BOOL OSUnScheduleTimerEvent(void *event, UINT8 interruptIndex)
{
  DELETEQUEUE_OP des, *pendingOp;
  TIMER_ISR_DATA *device;
  des.EventOp = DeleteEventOp;  // Prepare the removal so that other task may complete
  des.Done = FALSE;             // it.
  device = (TIMER_ISR_DATA *)OSGetISRDescriptor(interruptIndex);
  des.Left = (TIMER_EVENT_NODE *)device->EventQueue;
  des.Event = event;
  des.Node = (TIMER_EVENT_NODE *)&des;
  pendingOp = device->PendingQueueOperation;
  if (pendingOp != NULL) {      // Is there an incomplete operation under way?
     if (pendingOp->EventOp == InsertEventOp)
        InsertQueueHelper((INSERTQUEUE_OP *)pendingOp,device,TRUE);
     else
        DeleteQueueHelper(pendingOp);
  }
  device->PendingQueueOperation = &des;    // Post the insertion for other tasks
  DeleteQueueHelper(&des);                 // Do the operation
  device->PendingQueueOperation = NULL;
  if (des.Node != (TIMER_EVENT_NODE *)&des) {
     ReleaseNode(device,des.Node);
     return TRUE;
  }
  else
     return FALSE;
} /* end of OSUnScheduleTimerEvent */


/* DeleteQueueHelper: Performs the delete operation described by a descriptor from a list
** of events. Whenever a deleter is interrupted in the midst of this operation by another
** task, the latter task removes the node of the interrupted deleter before completing
** its own operation. */
void DeleteQueueHelper(DELETEQUEUE_OP *des)
{
  TIMER_EVENT_NODE *right, *left = des->Left;
  while (TRUE) {             // Loop until done
     right = left->Next;     // Get adjacent node
     if (des->Done)          // Has a higher priority task finished the work?
        break;
     else if (right == NULL) {  // Is the seeked node already removed from the queue?
        des->Done = TRUE;       // Mark that node has been inserted
        break;
     }
     else if (des->Event == right->Event) {
        while (OSUINTPTR_LL((UINTPTR *)&des->Node) == (UINTPTR)des && !des->Done)
           if (OSUINTPTR_SC((UINTPTR *)&des->Node,(UINTPTR)right))
              break;
        while (OSUINTPTR_LL((UINTPTR *)&left->Next) == (UINTPTR)right)
           if (des->Done || OSUINTPTR_SC((UINTPTR *)&left->Next,(UINTPTR)right->Next))
              break;
        des->Done = TRUE;    // Mark that the node has been removed
        break;
     }
     else
        left = des->Left = right;
  }
} /* end of DeleteQueueHelper */


/* GetFreeNode: : Returns a node from the pool of free nodes. NULL is returned when
** none are available. The free node list is considered to be a stack of nodes. */
TIMER_EVENT_NODE *GetFreeNode(TIMER_ISR_DATA *des)
{
  TIMER_EVENT_NODE *node;
  while ((node = (TIMER_EVENT_NODE *)OSUINTPTR_LL((UINTPTR *)&des->FreeNodes)) != NULL)
     if (OSUINTPTR_SC((UINTPTR *)&des->FreeNodes,(UINTPTR)node->Next))
        break;
  return node;
} /* end of GetFreeNode */


/* ReleaseNode: Returns a node to the pool of free nodes. */
void ReleaseNode(TIMER_ISR_DATA *device, TIMER_EVENT_NODE *freeNode)
{
  while (TRUE) {
     freeNode->Next = (TIMER_EVENT_NODE *)OSUINTPTR_LL((UINTPTR *)&device->FreeNodes);
     if (OSUINTPTR_SC((UINTPTR *)&device->FreeNodes,(UINTPTR)freeNode))
        return;
  }
} /* end of ReleaseNode */


