beber007/zottaos/ZottaOS/CORTEX-M3/STM32/ZottaOS_TimerEvent.c
/* TimerIntHandler: ISR routine called whenever the timer device gets an interrupt. */
void TimerIntHandler(TIMER_ISR_DATA *device)
{
  UINT16 time16;
  TIMER_EVENT_NODE *eventNode;
  INSERTQUEUE_OP *pendingOp;
  #if defined(STM32L1XXXX)
    if (device->Base == BASE_TIM5) {
  #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
     if (device->Base == BASE_TIM2 || device->Base == BASE_TIM5) {
  #endif
  #if defined(STM32L1XXXX) ||  defined(STM32F2XXXX) || defined(STM32F4XXXX)
        *(UINT32 *)(device->Base + OFFSET_COMPARATOR) = 0; // Disable timer comparator
     }
     else {
  #endif
        *(UINT16 *)(device->Base + OFFSET_COMPARATOR) = 0; // Disable timer comparator
  #if defined(STM32L1XXXX) ||  defined(STM32F2XXXX) || defined(STM32F4XXXX)
     }
  #endif
  /* First finalize any pending operation in case there is an inserted node that already
  ** has its occurrence time but is not yet in the queue. */
  pendingOp = (INSERTQUEUE_OP *)device->PendingQueueOperation;
  if (pendingOp != NULL) {       // Is there an incomplete operation under way?
     if (pendingOp->EventOp == InsertEventOp)
        InsertQueueHelper(pendingOp,device,FALSE);
     else
        DeleteQueueHelper((DELETEQUEUE_OP *)pendingOp);
  }
  device->PendingQueueOperation = NULL;
  /* Test interrupt source */
  if (*(UINT16 *)(device->Base + OFFSET_STATUS) & 2)   // Is comparator interrupt pending?
     *(UINT16 *)(device->Base + OFFSET_STATUS) &= ~2;  // Clear interrupt flag
  if (*(UINT16 *)(device->Base + OFFSET_STATUS) & 1) { // Is timer overflow interrupt?
     *(UINT16 *)(device->Base + OFFSET_STATUS) &= ~1;  // Clear interrupt flag
     #if defined(STM32L1XXXX)
        if (device->Base == BASE_TIM5) {
     #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
        if (device->Base == BASE_TIM2 || device->Base == BASE_TIM5) {
     #endif
     #if defined(STM32L1XXXX) ||  defined(STM32F2XXXX) || defined(STM32F4XXXX)
           eventNode = device->EventQueue->Next;
           while (eventNode != NULL) {
              eventNode->Time -= SHIFT_TIME_LIMIT;
              eventNode = eventNode->Next;
           }
        }
        else {
     #endif
           device->Time += 0x10000;    // Increment most significant word of Time
           if (device->Time >= SHIFT_TIME_LIMIT) { // Shift all time value
              eventNode = device->EventQueue->Next;
              while (eventNode != NULL) {
                 eventNode->Time -= SHIFT_TIME_LIMIT;
                 eventNode = eventNode->Next;
              }
              device->Time -= SHIFT_TIME_LIMIT;
           }
     #if defined(STM32L1XXXX) ||  defined(STM32F2XXXX) || defined(STM32F4XXXX)
        }
     #endif
  }
  #if defined(STM32L1XXXX)
     if (device->Base == BASE_TIM5) {
  #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
     if (device->Base == BASE_TIM2 || device->Base == BASE_TIM5) {
  #endif
  #if defined(STM32L1XXXX) ||  defined(STM32F2XXXX) || defined(STM32F4XXXX)
        // Schedule events that now occur
        eventNode = device->EventQueue->Next;
        while (eventNode != NULL && eventNode->Time <= *(UINT32 *)(device->Base + OFFSET_COUNTER)) {
           OSScheduleSuspendedTask(eventNode->Event);
           device->EventQueue->Next = eventNode->Next;
           ReleaseNode(device,eventNode);
           eventNode = device->EventQueue->Next;
        }
        // Program timer comparator
        do {
           OSUINT32_LL((UINT32 *)(device->Base + OFFSET_COMPARATOR));
           if (eventNode->Time - TIMER_OFFSET < *(UINT32 *)(device->Base + OFFSET_COUNTER)) {
              *(UINT16 *)(device->Base + OFFSET_EVENT_GENERATION) = 2;
              break;
           }
        } while (!OSUINT32_SC((UINT32 *)(device->Base + OFFSET_COMPARATOR),eventNode->Time));
     }
     else {
  #endif
        // Schedule events that now occur
        eventNode = device->EventQueue->Next;
        while (eventNode != NULL && eventNode->Time <= (device->Time | *(UINT16 *)(device->Base + OFFSET_COUNTER))) {
           OSScheduleSuspendedTask(eventNode->Event);
           device->EventQueue->Next = eventNode->Next;
           ReleaseNode(device,eventNode);
           eventNode = device->EventQueue->Next;
        }
        if ((eventNode->Time & 0xFFFF0000) == device->Time) {
           time16 = (UINT16)eventNode->Time;
           do {
              OSUINT16_LL((UINT16 *)(device->Base + OFFSET_COMPARATOR));
              if (time16 - TIMER_OFFSET < *(UINT16 *)(device->Base + OFFSET_COUNTER)) {
                 *(UINT16 *)(device->Base + OFFSET_EVENT_GENERATION) |= 2;
                 break;
              }
           } while (!OSUINT16_SC((UINT16 *)(device->Base + OFFSET_COMPARATOR),time16));
        }
  #if defined(STM32L1XXXX) ||  defined(STM32F2XXXX) || defined(STM32F4XXXX)
     }
  #endif
} /* end of TimerIntHandler */
